Public Member Functions | Public Attributes | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::BendDefault Class Referencefinal
MEP Element Manager
The BendDefault contains the necessary non-geometric data for modifying a Bend. More...
#include <MEPBendDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::BendDefault:
 Public Member Functions
double  | GetFactorRadius () const
The radius of the Bend is calculated with the help of this value.
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
Result< void >  | SetFactorRadius (double factor)
Sets the factor of the radius of the BendDefault.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Public Attributes
friend  | BendDefault
 Public Attributes inherited from ACAPI::MEP::v1::ElementDefault
friend  | ElementDefault
 Protected Member Functions
BendDefault (std::shared_ptr< Impl::IBendDefaultImpl >)
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
virtual  | ~Modifier ()
 Static Protected Member Functions
static Result< BendDefault >  | Create (const API_Token &, Domain)
 Friends
class  | RoutingNode
class  | RoutingNodeDefault
class  | Bend
Result< BendDefault >  | CreateBendDefault (Domain)
Creates a BendDefault.
Detailed Description
The BendDefault contains the necessary non-geometric data for modifying a Bend.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingNodeDefault
Constructor & Destructor Documentation
◆ BendDefault()
 ACAPI::MEP::v1::BendDefault::BendDefault  |  ( |  std::shared_ptr< Impl::IBendDefaultImpl >  |   | )
protected
Member Function Documentation
◆ Create()
 static Result< BendDefault > ACAPI::MEP::v1::BendDefault::Create  |  ( |  const API_Token &  |  ,
|  Domain
)
staticprotected
◆ GetFactorRadius()
 double ACAPI::MEP::v1::BendDefault::GetFactorRadius  |  ( |   | ) |   const
The radius of the Bend is calculated with the help of this value.
Returns
Returns the factor of the BendDefault.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::v1::BendDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetFactorRadius()
 Result< void > ACAPI::MEP::v1::BendDefault::SetFactorRadius  |  ( |  double  |  factor | )
Sets the factor of the radius of the BendDefault.
Parameters
factor | The value to be set. Needs to be between 0.6 and 3.0.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
Friends And Related Symbol Documentation
◆ Bend
 friend class Bend
friend
◆ CreateBendDefault
 Result< BendDefault > CreateBendDefault  |  ( |  Domain  |  domain | )
friend
Creates a BendDefault.
Parameters
domain | The Domain of the requested BendDefault.
Returns
If able, returns a copy of Archicad's current Default of the Bend from the Routing tool for the domain defined by the parameter, otherwise Error.
◆ RoutingNode
 friend class RoutingNode
friend
◆ RoutingNodeDefault
 friend class RoutingNodeDefault
friend
Member Data Documentation
◆ BendDefault
 friend ACAPI::MEP::v1::BendDefault::BendDefault